//
//  PickerContents.swift
//  CHECKPASS
//
//  Created by 이정훈 on 12/27/23.
//

struct PickerContents {
    static let userTypes: [String] = ["선택", "학생", "교수", "교직원"]
    static let colleges: [String] = ["선택", "융합기술대학", "공과대학", "인문사회대학", "보건생명대학", "철도대학", "미래융합대학", "자유전공학부", "창의융합학부"]
    static let departments: [String: [String]] = ["선택": ["선택"], "융합기술대학": ["선택", "기계공학과", "자동차공학과", "항공·기계설계학과", "전기공학과", "전자공학과", "컴퓨터공학과", "컴퓨터소프트웨어학과", "AI로봇공학과", "바이오메디컬융합학과", "정밀의료·의료기기학과"], "공과대학": ["선택", "건설환경도시교통공학부", "사회기반공학전공", "환경공학전공", "도시·교통공학전공", "화공생물공학과", "반도체신소재공학과", "나노화학소재공학과", "산업경영공학과", "안전공학과", "건축공학과", "건축학과(5년제)", "산업디자인학과", "커뮤니케이션디자인학과"], "인문사회대학": ["선택", "영어영문학과", "중국어학과", "한국어문학과", "행정학과", "행정정보융합학과", "경영학과", "융합경영학과", "국제무역학과", "사회복지학과", "음악학과", "스포츠의학과", "스포츠산업학과", "항공서비스학과", "항공운항학과", "유아교육학과", "미디어&콘텐츠학과"], "보건생명대학": ["선택", "간호학과", "물리치료학과", "응급구조학과", "식품생명학부", "식품공학전공", "식품영양전공", "생명공학전공", "유아특수교육학과", "IT응용융합학과", "화장품산업학과", "천연물소재학과"], "철도대학": ["선택", "철도경영·물류학과", "AI데이터공학부", "데이터사이언스전공", "인공지능전공", "철도운전시스템공학과", "철도차량시스템공학과", "철도인프라공학과", "철도전기정보공학과"], "미래융합대학": ["선택", "안전융합공학과", "건설방재융합공학과", "스포츠복지학과", "복지·경영학과", "스마트철도교통공학과", "이차전지공학과"], "자유전공학부": ["자유전공학부"], "창의융합학부": ["창의융합학부"]]
    static let grades: [String] = ["선택", "1학년", "2학년", "3학년", "4학년"]
    static let dayOrNight: [String] = ["선택", "주간", "야간"]
    static let semesters: [String] = ["선택", "1학기", "2학기"]
}
